import React from 'react';

const CooperationAgreement = () => {
  return (
    <div className="max-w-4xl mx-auto px-4 py-8 font-sans">
      <h1 className="text-3xl font-bold text-center mb-8">ДОГОВОР №____<br />о коммерческом сотрудничестве</h1>

      <div className="text-center mb-8">
        <p className="text-sm">г. _______________</p>
        <p className="text-sm">«_____» _______________ 2025 г.</p>
      </div>

      <div className="text-sm mb-6">
        <p className="mb-4">_______________________________________________________________________________ в лице ________________________________________________, действующего на основании ________________________________________________, именуемый в дальнейшем «Поставщик», с одной стороны,</p>
        <p className="mb-4">И Общество с ограниченной ответственностью «ЭПП АЙ СТУДИО» в лице директора Кишенова Анарбека Нурбековича, действующего на основании Устава, именуемый в дальнейшем «Организация», с другой стороны, именуемые в дальнейшем «Стороны», заключили настоящий договор, в дальнейшем «Договор», о нижеследующем:</p>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">1. ПРЕДМЕТ ДОГОВОРА</h2>
        <div className="text-sm">
          <p className="mb-4">1.1. Предметом настоящего Договора является взаимовыгодное сотрудничество сторон в сфере поиска Клиентов и размещении рекламы товаров «Поставщика», на онлайн торговой площадке «MarketKG», выставленных на продажу по цене Поставщика.</p>
          <p className="mb-4">1.2. «Клиентом» является лицо, найденное Организацией или обратившееся в MarketKG, с целью приобретения товаров разного рода.</p>
          <p className="mb-4">1.3. В случае приобретения Клиентом товаров Поставщика, Поставщик обязуется выплатить Организацию вознаграждение в размере ________% от стоимости реализуемого товара.</p>
          <p className="mb-4">1.4. Предоставленный товар со стороны Поставщика обрабатывается Организацией в течении _____ дней и размещается на маркетплейсе MarketKG. При обработке товаров Организация руководствуется законодательством Кыргызской Республики и внутренними локальными актами. По результатам обработки, Организация вправе отказать Поставщику в размещении товара в маркетплейсе, предоставляя письменный аргумент отказа.</p>
          <p className="mb-4">1.4. Оплата за реализованный товар осуществляется на расчетный счет «Организации», затем Организация перечисляет на счет «Поставщика».</p>
          <p>1.6. Оплаты и расчеты между Сторонами может определиться индивидуально путем составления дополнительного соглашения.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">2. ИНФОРМАЦИЯ О ТОВАРЕ</h2>
        <div className="text-sm">
          <p className="mb-4">2.1. Товар должен быть представлен на Сайте через фото-образцы, являющиеся собственностью Поставщика.</p>
          <p className="mb-4">2.2. Каждый фото-образец должно сопровождаться текстовой информацией: ценой и описанием товара.</p>
          <p className="mb-4">2.3. Согласно настоящему договору, Организация (call центр) обязан предоставить (по телефону или посредством электронной почты) прочую информацию, необходимую и достаточную, с точки зрения Клиента, для принятия им решения о покупке товара.</p>
          <p className="mb-4">2.4. Указанная на Сайте цена товара не может быть изменена Поставщиком в одностороннем порядке.</p>
          <p>2.5. Об изменениях цен и других характеристик товаров, Поставщик обязан уведомить Организацию за 5 (пять) рабочих дней, до фактического изменения.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">3. ПРАВА И ОБЯЗАННОСТИ «Поставщика»</h2>
        <div className="text-sm">
          <p className="mb-4 font-medium">Поставщик имеет право:</p>
          <p className="mb-4">3.1. Проводить за свой счет и по своему усмотрению рекламные кампании, направленные на продвижение предлагаемых Организацией товаров на рынке Кыргызстана.</p>
          <p className="mb-4">3.2. Осуществлять поиск потенциальных Клиентов через онлайн платформу MarketKG.</p>
          <p className="mb-4">3.3. Разместить свои товары, отвечающие требованиям MarketKG.</p>
          <p className="mb-4">3.4. Получать необходимую информацию о статусе товаров, о деятельности Организации и.т.д.</p>

          <p className="mb-4 font-medium mt-6">3.5. Поставщик обязуется:</p>
          <p className="mb-4">3.5.1. Предоставить полную и достоверную информацию о товаре и услуг.</p>
          <p className="mb-4">3.5.2. Поставить Товар в соответствии с условиями Заказа.</p>
          <p className="mb-4">3.5.3. Гарантировать соответствие качества Товара требованиям для аналогичных Товаров на территории КР.</p>
          <p className="mb-4">3.5.4. Нести ответственность за порчу и брак реализуемого товара, если вина Поставщика выявится.</p>
          <p className="mb-4">3.5.5. Не продавать, не размещать товары, запрещенные Законодательством Кыргызской Республики. Если такой случай выявится или Организация получить жалобы от Клиентов, то Организация имеет право исключить, удалить товар с MarketKG.</p>
          <p className="mb-4">3.5.6. Рассматривать претензии и заявления Покупателей в соответствии с действующим законодательством КР и принимать меры к их удовлетворению.</p>
          <p className="mb-4">3.5.7. Осуществлять сбор и обрабатывать персональные данные, в том числе биометрические данные, при необходимости осуществлять трансграничную передачу персональных данных Покупателя, предоставленные им, обеспечивать их конфиденциальность и не предоставлять доступ к этой информации третьим лицам, за исключением случаев, предусмотренных действующим законодательством КР и условиями настоящего Договора.</p>
          <p>3.5.8. При обращении менеджеров call центра Организации, Поставщик обязуется дать достоверную информацию о товаре, например: наличие товара, размер, цвет, цена и.т.д.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">4. ПРАВА И ОБЯЗАННОСТИ «Организации»</h2>
        <div className="text-sm">
          <p className="mb-4 font-medium">Организация имеет право:</p>
          <p className="mb-4">4.1. Запрашивать, требовать информацию о товаре и о необходимых документах.</p>
          <p className="mb-4">4.2. По своему усмотрению обрабатывать и размещать товары на маркетплейсе MarketKG.</p>
          <p className="mb-4">4.3. Самовольно решает, сортирует товары в системе MarketKG.</p>
          <p className="mb-4">4.4. Требовать от Поставщика своевременного и полного исполнения своих обязательств.</p>
          <p className="mb-4">4.5. Привлечь к ответственности (штрафным санкциям) в случае нарушения Поставщика своих обязательств перед MarketKG и Клиентами.</p>
          <p className="mb-4">4.6. По своему усмотрению выбрать и заключить договора с курьерскими службами.</p>

          <p className="mb-4 font-medium mt-6">Организация обязуется:</p>
          <p className="mb-4">4.7. Создать структурное подразделение как – call центр или отдел для удовлетворения требований клиентов. Все жалобы и предложении изначально обрабатываются указанным подразделением, затем передается Поставщику за решением обстоятельств.</p>
          <p>4.8. Своевременно отвечать, обрабатывать звонки и решить все требовании Клиентов в кратчайшие сроки.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">5. ПОРЯДОК ВЗАИМОРАСЧЕТОВ</h2>
        <div className="text-sm">
          <p className="mb-4">5.1. За предоставление услуг по поиску и привлечению клиентов, которые приобретают товар в маркетплейсе MarketKG, Поставщик обязуется выплатить Организации вознаграждение в размере ________% от стоимости товара/комиссии.</p>
          <p className="mb-4">5.2. Выплаты производятся в следующем порядке: Клиент оплачивает за приобретенный товар через систему MarketKG, оплаченная сумма поступает на счет Организации затем, Организация перечисляет денежные средства на счет Поставщика, удерживая сумму вознаграждения.</p>
          <p className="mb-4">5.3. Организация производит выплаты, удерживая вознаграждения, Поставщику в течении ________ рабочих дней с момента завершения сделки.</p>
          <p>5.4. Выплаты вознаграждения производятся в Кыргызских сомах.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">6. РАСТОРЖЕНИЕ И СРОК ДЕЙСТВИЯ ДОГОВОРА</h2>
        <div className="text-sm">
          <p className="mb-4">6.1. Настоящий Договор вступает в силу с момента его подписания обеими сторонами и действует в течение ________ месяца(ев). Стороны имеют право за ________ дней, до истечения срока Договора, сообщить другой стороне о расторжении договора. В случае, если уведомление о расторжении договора не поступило, данный Договор пролонгируется на следующие ________ месяца(ев).</p>
          <p>6.2. Стороны имеют право расторгнуть Договор в одностороннем порядке в период его действия, предупредив об этом другую сторону за ________ дней до даты расторжения Договора.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">7. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
        <div className="text-sm">
          <p className="mb-4">7.1. В случаях конфликта между Клиентом и Поставщиком, Организация имеет право вмешиваться в ситуацию и урегулировать спор в рамках действующего законодательства Кыргызской Республики. При этом за качество и брак товара Поставщика, никакой ответственности не несет.</p>
          <p className="mb-4">7.2. За описание и фото-видео материалы, предоставленные со стороны Поставщика в маркетплейс MarketKG, Организация не несет прямой и косвенной ответственности.</p>
          <p className="mb-4">7.3. За содержание, качество товара за несходство с рекламными материалами, ответственность на прямую несет Поставщик.</p>
          <p className="mb-4">7.4. Организация не несет ответственности за любые расходы Поставщика или прямой либо косвенный ущерб, который может быть нанесен Поставщику вследствие использования Интернет услуг, причиненный Пользователю в результате использования или невозможности пользования Услугами и понесенный в результате ошибок, пропусков, перерывов в работе, удаления файлов, изменения функций, дефектов упаковки, задержек в работе при передаче данных и т.п., случившихся не по вине Организации.</p>
          <p className="mb-4">7.5. Организация не несет ответственности за действия смежных служб и сервисов, используемых для предоставления Услуг Поставщику, но не принадлежащих MarketKG, например: банки, транспортные компании, интернет-провайдеры, емейл-сервисы, платежные системы и т.д.</p>
          <p className="mb-4">7.6. Курьеры и курьерские службы вправе провести первичный осмотр товара, проверять на брак, сходство и и.т.д. В случае обнаружения дефектов или несоответствия товара, то курьеры обращаются в сервисные центры Поставщика за решением вопросов.</p>
          <p className="mb-4">7.7. Стороны приложат все усилия для разрешения споров путем переговоров, в случае если нет возможности достижения соглашения, споры рассматриваются в соответствии с законодательством страны.</p>
          <p className="mb-4">7.8. Любые вопросы, не оговоренные отдельно настоящим Договором, решаются сторонами, путем составления дополнительного соглашения к данному договору.</p>
          <p className="mb-4">7.9. Каждая из сторон обязуется соблюдать полную конфиденциальность относительно деловых и финансовых источников и сделок противоположной стороны, а также сделок по приобретению Клиентом товаров в маркетплейсе MarketKG.</p>
          <p className="mb-4">7.10. Любая информация подлежит оглашению только после специального письменного разрешения соответствующей стороны.</p>
          <p className="mb-4">7.11. Данные сторонами обязательства по сохранению конфиденциальности информации, полученной в рамках настоящего Договора, сохраняют свою силу в течение 5 лет после истечения срока действия или расторжения настоящего Договора.</p>
          <p className="mb-4">7.12. Стороны предоставляют друг другу все необходимые разрешения на использование логотипов, торговых марок и других брендовых элементов для целей маркетинговых кампаний, и рекламных материалов.</p>
          <p className="mb-4">7.13. Стороны могут проводить совместные маркетинговые акции, направленные на привлечение клиентов и повышение узнаваемости брендов.</p>
          <p>7.14. Все изменения и дополнения к настоящему Договору производятся при обоюдном согласии сторон, оформляются в письменном виде и являются неотъемлемой частью Договора.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">8. ФОРС-МАЖОР</h2>
        <div className="text-sm">
          <p className="mb-4">8.1. Ни одна из Сторон не несет ответственности перед другой Стороной за неисполнение обязательств по настоящему Договору, обусловленное действием обстоятельств непреодолимой силы, т.е. чрезвычайных и непредотвратимых при данных условиях обстоятельств, возникших помимо воли и желания Сторон и которые нельзя предвидеть или избежать, в том числе объявленная или фактическая война, гражданские волнения, эпидемии, блокада, эмбарго, пожары, землетрясения, наводнения и другие природные стихийные бедствия, а также издание актов государственных органов.</p>
          <p className="mb-4">8.2. Сторона, которая не исполняет своего обязательства вследствие действия непреодолимой силы, должна незамедлительно известить другую Сторону о таких обстоятельствах и их влиянии на исполнение обязательств по Договору.</p>
          <p className="mb-4">8.3. Сбои в системе, неисправность интернет-служб, блокировка аккаунта, блокировка счетов, сбои при переводе денежных средств относятся к форс-мажорным обстоятельствам, поскольку указанные пункты не зависит ни от Организации и Поставщика.</p>
          <p>8.4. В форс-мажорных обстоятельствах, как: ДТП с участием курьера, порча товара во время перевозки и.т.д., Стороны обязуется в максимально кратчайшие сроки удовлетворить требовании клиента, затем перейти на разбирательства. Стороны согласились что, во всех непредвиденных ситуациях будут решать вопросы, запросы клиентов.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">9. Изменение и расторжение договора</h2>
        <div className="text-sm">
          <p>9.1. Договор может быть досрочно расторгнут по соглашению Сторон либо по требованию одной из Сторон в порядке и по основаниям, предусмотренных законодательством КР при условии письменного уведомления другой Стороны об отказе, направленного не позднее чем за 30 (тридцать) календарных дней до предполагаемой даты расторжения.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">10. Разрешение споров</h2>
        <div className="text-sm">
          <p className="mb-4">10.1. В случае возникновения между Сторонами споров, претензий, противоречий относительно толкования, действительности, исполнения или прекращения настоящего Договора. Стороны обязуются приложить все усилия для достижения их урегулирования путём переговоров, либо направить письменную претензию, срок рассмотрения которой составляет – 5 (пять) рабочих дней.</p>
          <p className="mb-4">10.2. Все не урегулированные споры, связанные с заключением, толкованием, исполнением, изменением и расторжением Договора, передаются в суд.</p>
          <p>10.3. Все иные вопросы, не урегулированные настоящим Договором, разрешаются в соответствии с действующим законодательством Кыргызской Республики.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">11. Заключительные положения</h2>
        <div className="text-sm">
          <p className="mb-4">11.1. Договор вступает в силу и становится обязательным для сторон с момента его заключения и действует до «___»________ 202__ г.</p>
          <p className="mb-4">11.2. Уведомления, требования и иные документы, связанные с Договором, должны направляться сторонами следующими способами: телефонные звонки, чаты, каналы и.т.д.</p>
          <p className="mb-4">Тел. Организации___________________почта___________________________</p>
          <p className="mb-4">Тел. Поставщика __________________почта__________________________</p>
          <p className="mb-4">11.3. Копии документов, связанные с Договором и переданные по факсимильной или иной связи, приравниваются к оригиналам до получения подлинника. Предоставление и подписание подлинников обязательно в течение 10 календарных дней.</p>
          <p className="mb-4">11.4. Стороны обязуются соблюдать конфиденциальность информации, получаемой в процессе исполнения Договора, а также обязуются не разглашать условия Договора. Любой ущерб, причиненный Стороне несоблюдением режима конфиденциальности, приведший к недобросовестной конкуренции, нарушению положений о коммерческой тайне, о рекламе, или интеллектуальной собственности, введший в заблуждение, дискредитировавший, или причинивший вред деловой репутации, правам и законным интересам Стороны или иных третьих лиц, подлежит полному возмещению виновной Стороной.</p>
          <p className="mb-4">11.5. Организация или Сотрудники организации не являются работниками Поставщика и не состоит с последним в трудовых отношениях в связи с заключением настоящего договора.</p>
          <p>11.6. Договор составлен в 2-х экземплярах, по одному для каждой из сторон.</p>
        </div>
      </div>

      <div className="border-b border-gray-300 pb-4 mb-6">
        <h2 className="text-xl font-semibold mb-4">7. ЮРИДИЧЕСКИЕ АДРЕСА И БАНКОВСКИЕ РЕКВИЗИТЫ СТОРОН</h2>
        <div className="text-sm grid grid-cols-1 md:grid-cols-2 gap-6">
          <div>
            <p className="font-medium mb-2">Организация:</p>
            <p>ОсОО “ЭПП АЙ СТУДИО</p>
            <p>Кыргызская Республика,</p>
            <p>г. Бишкек, ул. Киевская 77, 31-кабинет</p>
            <p>ИНН: 02305202410481</p>
            <p>ОКПО: 32893353</p>
            <p>БИК: 124032</p>
            <p>Банк: ОАО «Бакай Банк»</p>
            <p>р/счет: 1240020001771668</p>
            <p>тел.: +996 505 484 840</p>
          </div>
          <div>
            <p className="font-medium mb-2">Поставщик:</p>
            <p>_______________________</p>
            <p>Юр. адрес:______________</p>
            <p>ИНН:__________________</p>
            <p>ОКПО:_________________</p>
            <p>Банк:___________________</p>
            <p>Рас./счёт:_______________</p>
            <p>Корр./счёт:______________</p>
            <p>БИК: __________________</p>
            <p>Тел:____________________</p>
          </div>
        </div>
      </div>

      <div className="mt-8">
        <h2 className="text-xl font-semibold mb-4">8. ПОДПИСИ СТОРОН</h2>
        <div className="text-sm grid grid-cols-1 md:grid-cols-2 gap-6">
          <div>
            <p className="font-medium mb-2">Организация:</p>
            <p>Генеральный директор</p>
            <p>______________/Кишенов А. Н.</p>
            <p>МП</p>
          </div>
          <div>
            <p className="font-medium mb-2">Поставщик:</p>
            <p>_______________________/</p>
            <p>_________________________</p>
            <p>МП</p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default CooperationAgreement;